{
  "start": "September 2016",
  "sections": [
    {
      "heading": "Summary",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066887/Dancemaker/app-store-screens.png",
      "body": "Working hand-in-hand with students, teachers and administrators, I led the concept and development of an app for 92Y Dance Education Laboratory (DEL) to advance their mission of bringing dance into every New York City classroom.\n\nI carefully guided the project from concept to implementation by facilitating user research, iterating through a series of interactive prototypes, modeling and developing a content database, designing a visual identity with cross-platform mobile interfaces, overseeing development, and leading app-related professional development classes for the community.",
      "topic": "Product Design"
    },
    {
      "heading": "Challenges",
      "body": "### The great unknown\n\nThis was a project largely without precedent. In order to workshop its hypothetical features with the community, we devised approachable entry-points and clear boundaries for the conceptual space so everyone involved felt comfortable to engage and contribute.\n\n### Boots, meet straps\n\nOur shoestring budget necessitated a creative approach to interactions and content strategy. We sought efficient solutions to each objective without negatively impacting the quality of user experience or design polish.",
      "topic": ""
    },
    {
      "heading": "Establishing context",
      "body": "DEL provides dance education training to teachers and students, empowering them to design and lead lessons for many kinds of classrooms and studios. \n\nThe DEL model is built with a clear structure and rationale, which I interpreted into a series of proposals for digital interaction through a process of research and collaboration.\n\nThe proposals served several purposes: \n\n1. Educate the client on the design lifecycle\n2. Identify requirements, dependencies and roles\n3. Provide a budget and timeline\n\n![Grid of pages depicting proposal document](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066926/Dancemaker/dancemaker-proposal-2.png \"Excerpts from one of several proposals\")",
      "topic": ""
    },
    {
      "heading": "Listening & learning",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066962/Dancemaker/workshop-1.jpg",
      "body": "At the onset of our design process, we worked with a panel of professional advisors to establish goals and determine avenues of concern. I led a series of discussions where we whittled our extensive initial proposal down to a clear, purposeful scope.\n\nThe most important change we made was to reduce the features of our  MVP, focusing in on the “exploration” and “development” components of DEL's 7-part lesson structure. We made this change for two reasons: \n\n1. Teachers each have a unique way of working on and running lessons so it’s unlikely a turn-key lesson building walkthrough would satisfy most of our users.\n2. Reducing complexity in this case increases flexibility of application, an especially significant gain for an app designed to expand creative thinking and encourage imagination.",
      "topic": "UX Research"
    },
    {
      "heading": "Exploring interactions",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066985/Dancemaker/learning-docs.png",
      "body": "I assembled a series of wireframes and interactive prototypes to communicate the flow of interaction through several primary funnels. These funnels were meant to address the needs of our educator personas. \n\nAs our research evolved, I adjusted these prototypes to re-prioritize touchpoints, mitigate pain points and reinforce the underlying principles of DEL’s method. \n\nWe used [Invision](https://invisionapp.com) to share clickable prototypes with the team, which made for easy updates and pain-free behavior demonstrations.\n\n![A grid of 16 plain UI screens](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067003/Dancemaker/prototype-1-partial.png \"Views from an early MVP prototype\")\n\n![A colorful grid of 11 different UI screens](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067017/Dancemaker/prototype-2-partial.png \"Views from a prototype exploring new content\")",
      "topic": "Prototyping"
    },
    {
      "heading": "Finding the words",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067041/Dancemaker/help-screens-v2.jpg",
      "body": "I crafted a tone for the app based on the DEL brand to inform the writing of help screens, UI labels and listings descriptions. This language was improved incrementally as our users provided feedback. \n\nThe niche lexicon of dance education posed another writing challenge: can microcopy bring casual users into relationship with esoteric concepts? What does it take to write language that is clear, precise and inclusive?\n\n![4 app screens with colorful graphics and short phrases](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067068/Dancemaker/help-screens-v1.jpg \"Early help screens\")\n\nAs with most questions, the answer came from our community. I talked with a breadth of users from expert to unfamiliar to better understand how they think about — and just as importantly how they _talk_ about — the sequences we were building out. \n\nFrom stakeholder conversations I established semantic bridges from familiar to unfamiliar terms. This helped us craft clear language that could reach several distinct groups, including dancers without teaching experience and teachers with no relationship to DEL.\n\n![A table of terms describing how phrases bridge the familiar and unfamiliar](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067113/Dancemaker/wordbridges.png \"Excerpt from bridging terms\")\n\n![4 colorful onboarding screens with illustrations](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067128/Dancemaker/onboarding-sequence.jpg \"Onboarding sequence\")",
      "topic": "Writing & Microcopy"
    },
    {
      "heading": "Oblique Strategies",
      "body": "As the application’s features began to coalesce, I noticed a recurring pattern of approach that reminded me of something I’d experimented with before, Brian Eno and Peter Schmidt’s [Oblique Strategies](https://en.wikipedia.org/wiki/Oblique_Strategies). _Strategies_ presents a method of encouraging lateral thinking by subverting the prototypical relationships among ideas and actions. It helps us break out of our usual ways of thinking.\n\nI sketched out a feature called the “Idea Machine” that would source thought exercises from the DEL community as an extension of the app’s main workflow. When I presented the feature to our team, we realized it could incorporate suggestions from the [NYC DoE Blueprint for Dance](https://www.weteachnyc.org/resources/resource/dance-blueprint-for-teaching-and-learning/), a document we'd been working to incorporate somehow.\n\nThe resulting module (now known as \"Tips & Tricks\") offered a novel, non-linear way for teachers to brainstorm institutionally validated lesson objectives for a given K-12 age cohort.\n\n![Three screenshots depicting the tips and tricks feature (originally idea machine)](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067157/Dancemaker/screens-ideas.png \"Tips and tricks\")",
      "topic": "Prototyping"
    },
    {
      "heading": "Building content",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067180/Dancemaker/workshop-2.jpg",
      "body": "After arriving at specifications for a minimum viable product, I extrapolated placeholders into an information architecture with a supporting content strategy the community could engage with.\n\nWorking directly with students and teachers, I built out a database of vocabulary terms. We held sessions at 92Y to brainstorm hundreds of action words and categories for the 'movement sentences' feature. This was also an opportunity to share our prototype with a broader group of teachers and discuss their impressions.\n\nSubsequent the brainstorming sessions, I wrote python scripts to generate JSON documents from plaintext lists and CSV exports and uploaded everything to [Firebase](http://firebase.com) for easy API access. \n\n![Screenshot of portions of 3 spreadsheets](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067206/Dancemaker/frames-from-data.png \"Organizing content\")\n\n```{ title=\"Basic data processing script\" }\nimport csv\nimport json\nimport itertools\nimport pandas as pd\nfrom time import gmtime, strftime\n\ndata = {}\nwith open('sources/dance-maker.json') as json_data:\n   data = json.load(json_data)\n\t\n# ------------------------\n#    Actions & Themes\n# ------------------------\nthemes = {}\nactions = {}\nwith open('sources/vocab.csv') as vocabCSV:\n   action_items = csv.reader(vocabCSV, delimiter=',')\n   for row in action_items:\n      theme = row[0]\n      themes[row[0]] = {'description' : row[0], 'tags' : [ row[0] ]}\n      for x in row[1:]:\n         if x > \"\":\n            if x in actions:\n               actions[x]['topics'][row[0]] = True\n            else:\n               actions[x] = {'topics': { row[0] : True }}\ndata['action-topics'] = themes\ndata['action-words'] = actions\n\n# ------------------------\n#        Resources\n# ------------------------\nresources = []\nwith open('sources/resources.csv') as resourcesCSV:\n   bookmarks = csv.DictReader(resourcesCSV, delimiter=',')\n   for row in bookmarks:\n      resources.append(row)\ndata['bookmarks'] = resources\n\n# ------------------------\n#      Idea Prompts\n# ------------------------\ncategories = {}\ncategoryKeys = []\nwith open('sources/idea-categories.csv') as categoriesCSV:\n   cats = csv.DictReader(categoriesCSV, delimiter=',')\n   for row in cats:\n      if int(row['count']) > 0:\n         categories[row['key']] = { 'name' : row['category'], 'description' : row['description']}\n         categoryKeys.append(row['key'])\ndata['idea-categories'] = categories\ndata['magic-8-categories'] = categories\n\nideas = []\nwith open('sources/ideas.csv') as ideasCSV:\n   next(ideasCSV)\n   prompts = csv.reader(ideasCSV, delimiter=',')      \n   for row in prompts:\n      p = {\n         \"text\" : row[0],\n         \"attr\" : row[1],\n         \"categories\" : {}\n      }\n      for count, c in enumerate(row[2:]):\n         if c == 'TRUE':\n            p['categories'][categoryKeys[count]] = True\n      ideas.append(p)\ndata['ideas'] = ideas\ndata['magic-8'] = ideas\n\nactionsFile = open('actions.txt', 'w')\nfor action in actions:\n   actionsFile.write(\"%s\\n\" % action)\n\nfilename = 'exports/dance-maker-' + strftime(\"%d-%m_%H-%M\",gmtime()) + '.json'\nwith open(filename, 'w') as outFile:\n   json.dump(data, outFile)\n```\n\nI also produced documentation and schedules for content generation, with guidelines meant to scaffold on DEL’s programs and professional development courses.\n\n![Six pages from a document describing how to manage content in the app](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067232/Dancemaker/content-strategy.png \"Basic content strategy documentation\")",
      "topic": "Information Architecture"
    },
    {
      "heading": "Painting pixels",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067263/Dancemaker/screens-misc.jpg",
      "body": "Borrowing from DEL’s visual identity, I came up with a set of basic principles that would define the app’s look & feel. I conformed our wireframes to this style in a Sketch file for developers to reference. \n\nI designed a preliminary logo and app icon for DEL to provide feedback on. Subsequent discussions gave me the clarity I needed to produce a more refined icon. The result drew inspiration from a Laban Movement Analysis chart, one of the conceptual cornerstones to DEL’s methodology.\n\n![A lateral series of progressively more complex icons](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067280/Dancemaker/icon-development-v2.png \"Design progression for the updated icon\")\n\nI also designed basic illustration elements and other assets to supplement information, interactions and identity.\n\n![An illustration of colorful machinery](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067297/Dancemaker/illustration-ideas.png \"An Idea Machine illustration\")",
      "topic": "UI Design"
    },
    {
      "heading": "Implementation",
      "body": "I worked closely with our developer throughout the implementation stage to clarify and revise almost every detail of the application, from custom algorithms to pixel polish. We were able to build a native iOS app that responded live to content updates, worked reliably across a variety of devices and generated the analytics we would need to provide meaningful improvements over the product’s life. After some testing and design updates, we followed up with an Android app that incorporated  learnings from the initial release and conformed the UI to [Material guidelines](https://material.io).\n\n### Pseudocode\n\nWe discovered a mismatch between how our movement exploration \"shuffle\" function worked compared to user expectations. Teachers we spoke with said they prefer to scaffold their lessons in a linear way, progressing from less challenging descriptors of _Body_ and _Space_ before moving into _Effort_ qualities and _Relationships_. Our completely random function was a usability trap for inexperienced users to fall into.\n\nWe didn't have sufficient resources to rebuild, so I worked with advisors to understand the related pedagogy more deeply. I realized that I could provide an algorithm to weight our shuffle behavior to retain a sense of unpredictability while favoring the foundational categories. This saved us precious development time without compromising the funnel's integrity.",
      "topic": "Code & QA"
    },
    {
      "heading": "Outcomes",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568067333/Dancemaker/CMOM-1.jpg",
      "body": "App in hand, we returned to the community for a series of presentations and workshops. I led a variety of exercises and discussions around the intentions and techniques of using the app before and during class. We consolidated feedback and first impressions, brainstormed next-steps and considered the implications of the product at both the individual and systemic level.\n\nSharing the project with students, dancers and educators was an invigorating experience. As we made dances together with the app, I reflected on how much good can happen when a group of open minded people tried something new and challenging together.\n\n![A colorful room with 8 people dancing in swooping motions](https://res.cloudinary.com/henryholmesdesign/video/upload/ac_none,c_limit,t_Loop,w_512/v1566838333/Dancemaker/dancing-with-cmom.gif \"Dancing with CMOM staff\")\n\nWe built something useful that students and teachers around the country understand and enjoy using. By grounding the experience in clear written language, we also found a way to expand the audience of the underlying concepts and increase engagement with DEL’s pedagogy.\n\nUnexpectedly, teachers of ELL students (English Language Learners) have shared their success using the app to build on language concepts during creative exercises, suggesting new possibilities for the future.\n\nDancemaker is available on [iOS](https://apps.apple.com/us/app/dancemaker/id1180809091) and [Android](https://play.google.com/store/apps/details?id=com.dancemaker.android). It’s been featured in the press ([Backstage](https://www.backstage.com/magazine/article/budding-choreographer-app-2931/), [Broadway World](https://www.broadwayworld.com/article/92Y-Unveils-Free-Dance-Maker-Choreography-App-20170918),) presented at [NDEO](https://www.ndeo.org), and incorporated at [92Y](https://www.92y.org/soa/dance/dance-education-laboratory-del), [the Children’s Museum of Manhattan](https://cmom.org/press/cmom-press-release-childrens-museum-of-manhattan-announces-opening-of-lets-dance/), [The Yard](http://www.dancetheyard.org), and in classes around the country.",
      "topic": "Teaching & Training"
    }
  ],
  "tasks": [
    "UX Research",
    "Prototyping",
    "UI Design",
    "Microcopy",
    "Teaching"
  ],
  "previous": "<a href=\"/project/park-mobile\">⬸ Park Mobile</a>",
  "cover": "https://res.cloudinary.com/henryholmesdesign/image/upload/c_scale,f_auto,fl_progressive,q_auto,w_640/f_auto,q_auto/v1568066839/Dancemaker/DEL12_17_1603038.jpg",
  "subtitle": "Shaping the future of dance education",
  "title": "Dance<wbr>maker",
  "type": "Case Study",
  "end": "July 2018",
  "id": "1",
  "tools": [
    "Sketch",
    "Invision",
    "Firebase",
    "Python",
    "XCode"
  ],
  "ongoing": false,
  "roles": [
    "Product Manager",
    "Design Principle"
  ]
}