{
  "start": "January 2016",
  "sections": [
    {
      "heading": "Summary",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1567635027/Park%20Mobile/onboarding.png",
      "body": "I was a core member of the team tasked with building the National Park Service official mobile app. I provided direction and deliverables across the full scope of the project from piloting and prototypes to deployment and maintenance. \n\nIn order to produce a framework that could adapt reliably to the needs of 300 million annual visitors across more than 400 sites nationwide we built a flexible content model and editor, facilitating high quality contributions from hundreds of park rangers around the country.\n\n![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567541531/Park%20Mobile/icons/compass.svg){ .section-break }",
      "topic": "Product Design"
    },
    {
      "heading": "Challenges",
      "sectionBanner": "",
      "body": "### Experience at scale\n\nAbsent a mature content and data API from the Park Service, each instance of the app would require a new set of contributors from the relevant parks who would need to create and organize a fresh dataset and content package. Our response was twofold: on the backend I scaffolded UX fieldwork into a robust editor model that could be translated into a CMS; on the frontend I helped to polish the interface and reinforce visual patterns that could adapt to a wide variety of content types and image qualities without compromising the overarching Park Mobile and NPS brands.\n\n### Data (and other deserts)\n\nGiven the remoteness and extreme conditions in most national parks, we knew to expect significant challenges around connectivity and byte-budgeting. This was exacerbated by a lackluster CDN beyond our control and wildly inconsistent data policies across the park system. We responded creatively with a myriad of compromises to mitigate visitor pain and re-center the core experience, included amplifying preparatory touchpoints in wifi-enabled locations, improving the clarity of asynchronous interactions, and building resilient live features to deliver the freshest data possible at every turn.\n\n### Accessibility matters\n\nI was responsible for devising a proprietary indoor proximity system to deliver audio descriptions at visitor centers across the system in compliance with federal accessibility guidelines. In order to accomplish this within budget, I led the design and configuration of an iBeacon-enabled indoor exhibit module that could be adapted for a wide variety of physical spaces.",
      "topic": "Information Architecture"
    },
    {
      "heading": "Piloting content",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066661/Park%20Mobile/banner-1-F2F1E9.jpg",
      "body": "When I joined the project early deployment of a pilot app was already underway at a handful of parks. For the pilot there were several goals in mind:\n\n1. **Learn how the park service thinks about its content.** What is important to them? What do they think is important to visitors?\n2. **Determine how the app will be adapted for parks of various types and sizes.** What guidelines should shape the adoption process of individual managers and contributors?\n3. **Formalize content strategies that will empower each park to set their own priorities.** What facets of the app should be universally required, as opposed to arbitrarily included on a case-by-case basis?\n\n![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567548207/Park%20Mobile/icons/wood_log.svg){ .section-break }\n\n### Analyzing patterns\n\nIn order to align our process with the needs of park editors, we took a look at the content choices each was making for their pilot app. This observational process informed our questions in stakeholder interviews and other design exercises.\n\n![A whiteboard depicting content types for 8 different parks](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567546979/Park%20Mobile/per-park-ia.jpg \"Identifying content patterns\")\n\nIt was important to be mindful of how we were grouping content types because any assumptions we introduced (even implicitly) would have a ripple effect on how contributors thought about their role and imagined possibilities. While we needed some explicit terms and categories to ground our conversations, I took extra precaution to encourage outside-the-box thinking and remind everyone to center their own perspectives. In this case, unique expectations were especially useful for identifying edge cases and refining scope.\n\n![A list of content items at 10 different parks](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567549063/Park%20Mobile/per%20park%20components.jpg \"Quantifying feature categories\")\n\n![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567619491/Park%20Mobile/icons/rope.svg){ .section-break }\n\n### Refactoring\n\nI sorted an expanded set of content types into buckets according to interaction methods, in order to understand how our new interface could be modeled. This provided us clarity as we outlined how we would be re-interpreting content from the pilot app.\n\n![A diagram of content types organized by discovery mode](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567552960/Park%20Mobile/interaction-patterns.png \"Modes of discovery for various content\")\n\n![An outline of content from a pilot app](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567617831/Park%20Mobile/CleanShot_2019-09-04_at_13.13.40_2x.png \"Outlining content elements\")\n\nI built spreadsheets to refactor data points into the new model. This produced a helpful byproduct of illuminating content balance and variety across different apps, which helped us align qualitative research with the nuts and bolts of the implementation.\n\n![A spreadsheet depicting a new location selection menu for rows of older content items](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567617733/Park%20Mobile/CleanShot_2019-09-04_at_13.01.07_2x.png \"Refactoring old content\")\n\n![Rows depicting categories and their respective subitems](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567618074/Park%20Mobile/CleanShot_2019-09-04_at_12.54.31_2x.png \"Grouping attributes\")\n\n![A list of categories in a menu being assigned to a site attribute](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567617988/Park%20Mobile/CleanShot_2019-09-04_at_13.12.38_2x.png \"Categorizing service tags\")",
      "bg": "#F2F1E9",
      "topic": "Information Architecture"
    },
    {
      "heading": "Deriving an interface",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1567618789/Park%20Mobile/home-iteration-2.png",
      "body": "Our next task was to identify an appropriate interaction pattern for the app's home screen. For context, the pilot had been designed to feature on the home page a prominent image from the park and recent news with other elements hidden behind a few layers of interaction. \n\nBased on the availability of relevant news and a shifting understanding of visitor priorities, we found the recent news feature less than relevant and noticed the slideshow of other images from the park (which was accessed by tapping the main image,) was rarely viewed. _Was this because the gallery was unimportant, or were our users struggling to access something they wanted?_\n\n![Klondike National Park pilot app home screen, annotated](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1567616881/Park%20Mobile/klgo-home-annotated.jpg \"Pilot app home screen\")\n\n![Screens with certain touchable regions marked with percentages from analytics data](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,h_704/v1567630551/Park%20Mobile/GOGA-analytics-visualization-161006.png \"Reviewing analytics\")\n\nOne way or another we needed to make better use of the available screen real estate. We arrived at a grid-based system that could provide one-tap access to any number of content items or features. I helped to iteratively refine the home page by testing various arrangements and tiles, building color schemes, and identifying harmonious measurements for the layout.\n\n![A photo of whiteboard notes on the home page structure](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567553152/Park%20Mobile/IMG_1305.jpg \"Developing home tile logic\")\n\nAfter introducing the updated grid interface to editors and in conjunction with the aforementioned image gallery oversight, we noticed an editorial opportunity: using tile images instead of our default color palette provided a visual overview of the park at a glance while providing quick access to related information. I updates our documentation to reflect this insight in a learning moment for our content contributors.\n\n![Home screens, one with colorful backgrounds and white icons, another with photo backgrounds](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567624836/Park%20Mobile/home-tiles-color-photo.jpg \"Home tile progressions\")\n\nIn conjunction with design updates I produced documentation to assist editors in acclimating to the new app. Our guidelines took a number of forms over the project's lifespan, including PDF documents, a standalone knowledge base website, and eventually inline CMS field comments.\n\n![A snippet of documentation describing the parts of the home screen](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_1394/v1567626094/Park%20Mobile/Home_Overview.png \"An excerpted diagram from mid-stage documentation\")\n\n![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567629983/Park%20Mobile/icons/bonfire.svg){ .section-break }",
      "bg": "#F2F1E9",
      "topic": "UI Design"
    },
    {
      "heading": "Animating prototypes",
      "body": "I built a series of animated prototypes in [Origami](https://origami.design) to conceive and illustrate behaviors for our developers.\n\n| ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631338/Park%20Mobile/gifs/park-mobile-onboarding.gif) | ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631363/Park%20Mobile/gifs/park-mobile-downloading.gif) |\n| --- | --- | --- |\n| ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631338/Park%20Mobile/gifs/park-mobile-home.gif) | ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631365/Park%20Mobile/gifs/park-mobile-search.gif) |\n| ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631338/Park%20Mobile/gifs/park-mobile-tile-press.gif) | ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631338/Park%20Mobile/gifs/park-mobile-save.gif) |\n| ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631338/Park%20Mobile/gifs/park-mobile-site.gif) | ![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,c_scale,w_320/v1567631338/Park%20Mobile/gifs/park-mobile-filter.gif) |\n\n![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567704963/Park%20Mobile/icons/rucksack.svg){ .section-break }",
      "bg": "#F2F1E9",
      "topic": "Interaction & Animation"
    },
    {
      "heading": "Modeling a content editor",
      "body": "One of the biggest concerns for the project's long-term success was an effective content management system. Taking from our client and visitor UX research and pilot data, I built an Airtable database to model a new CMS that would empower the project's hundreds of contributors to do their best work. My approach gave us an opportunity to separate our assumptions and intuitions in one scope from the technical requirements of another, bringing it all together in an intuitive and comprehensive accounting.\n\n![A spreadsheet grouping ](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1567634227/Park%20Mobile/CleanShot_2019-09-04_at_17.45.10_2x-min.png)\n\nI performed a thorough review of existing content in dynamic relationship to editor fields and version scope.\n\n![Spreadsheet of content items](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567634226/Park%20Mobile/CleanShot_2019-07-31_at_19.33.25_2x-min.png \"Evaluating content for scope and context\")\n\nI added screenshots to clarify how editor fields fed data to user facing interfaces.\n\n![A database of screens with associated content fields](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567634227/Park%20Mobile/CleanShot_2019-07-31_at_19.35.05_2x-min.png \"Connecting content and UI\")\n\nI synthesized existing content and new fields into a comprehensive set of editor requirements.\n\n![Spreadsheet of editor pages and fields](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567634226/Park%20Mobile/CleanShot_2019-07-31_at_19.35.29_2x-min.png \"Aligning user stories with editor contexts\")\n\nMy tables automatically generated a comprehensive editor specification based on the provided tables, views and priorities. This specification could grow over time as new content and fields were introduced.\n\n![Kanban cards for editor items with pages per column](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567634226/Park%20Mobile/CleanShot_2019-09-04_at_17.36.40_2x-min.png \"Bringing editor elements into focus\")",
      "bg": "#F2F1E9"
    },
    {
      "heading": "Anticipating poor connections",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066765/Park%20Mobile/banner-2-EAE8DB.jpg",
      "body": "We needed to figure out how best to deliver all this rich media and content to visitors in places with poor-to-no connectivity. I helped identify and prioritize downloads based on visitor needs, interface dependencies and timeliness. \n\n![A diagram of downloadable content types, sizes and priorities](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567637329/Park%20Mobile/data-download-priority.jpg \"Visualizing data priorities\")\n\nOnce we'd made sense of our priorities for downloading logic, I produced technical specifications that everyone on the team could understand and discuss.\n\n![A series of timelines depicting how information is downloaded](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567637252/Park%20Mobile/downloading-scheme.png \"Downloading logic diagrams\")\n\n### Dealing with imperfection\n\nOur approach to offline use was never perfect. Low connectivity is a hard problem to solve, in our case made harder still by the bifurcation of resources between our AWS backend and the government CDN hosting NPS media. \n\nAs we continued to refine our implementation, I pushed to build out more transparency for our users around what was happening with their connection and how it was impacting their app.\n\n![](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567705038/Park%20Mobile/icons/evergreen_trees.svg){ .section-break }",
      "bg": "#EAE8DB",
      "topic": "Code & QA"
    },
    {
      "heading": "Keeping things fresh",
      "body": "As the Park Service works to modernize their digital infrastructure, new opportunities are emerging to provide live data directly to visitors on their mobile devices. I led the effort to design and implement a series of live data layers in the app, which we prototyped at Yellowstone National Park.\n\n![An array of visual blocks depicting live data UI elements](https://res.cloudinary.com/henryholmesdesign/image/upload/v1567708123/Park%20Mobile/live-data-elements.jpg \"Live data elements\")\n\nI also worked on evolutions of the push notification logic, an important component of the timely UX strategy.\n\n![Several phone screens with push notifications](https://res.cloudinary.com/henryholmesdesign/image/upload/v1567704606/Park%20Mobile/notifications.jpg \"Outlining notification touchpoints\")",
      "bg": "#EAE8DB",
      "topic": "UI Design"
    },
    {
      "heading": "Improving Accessibility",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066788/Park%20Mobile/banner-3-DCD9C7.jpg",
      "body": "In order to provide better accessibility to park visitors, we were asked to design an indoor proximity system to provide spatially-relevant audio descriptions for visitor centers and other exhibits. I led the effort to conceive and model our approach using iBeacons and a proprietary ranging algorithm. The resulting feature is called the _\"Indoor Exhibit Module\"_ or IEM.\n\n![Diagram of indoor exhibit module data model](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567706168/Park%20Mobile/IEM_data_model.png \"The Indoor Exhibit Module\")\n\nI provided support both remotely and in person across dozens of IEM installations across the park system. One of my favorite trips was to install and configure beacons at Kennecott in Wrangell - St Elias National Park, Alaska.\n\n![A map of beacons for exhibits at Kennecott in Alaska](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567707486/Park%20Mobile/kennecott_iem.jpg \"IEM map for Kennecott\")\n\n![A panorama overlooking Kennecott Glacier in Alaska](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567708123/Park%20Mobile/kenecott.jpg \"A panorama at Kennecott\")\n\nAs our understanding of the challenges involved with successful audio descriptions improved, I helped to iteratively refactor the feature to meet evolving requirements.\n\n![Screenshots of data sheets for the indoor exhibit module](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/c_scale,w_2000/v1568063369/Park%20Mobile/IEM_data_structure.jpg \"IEM refactoring\")\n\n### Polishing VoiceOver\n\nI also helped to define and improve our audio description logic throughout the app so visitors using iOS VoiceOver would have the best possible experience. \n\n![Voiceover specifications for an app screen](https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto/v1567705971/Park%20Mobile/voiceover-intermediate.jpg \"Excerpt from VoiceOver specifications\")",
      "bg": "#DCD9C7",
      "fg": "",
      "topic": "Indoor Proximity"
    },
    {
      "heading": "Outcomes",
      "sectionBanner": "https://res.cloudinary.com/henryholmesdesign/image/upload/v1567711341/Park%20Mobile/Park_Mobile_android_icons.png",
      "body": "Since its introduction Park Mobile has been adopted by more than 30 parks in various stages of production, enriching many thousands of visits annually. Foregrounding flexibility and accessibility across our design process allowed the work to empower hundreds of dedicated civil servants around the country to tell impactful stories and broaden their stewardship of the public wilderness.\n\nThe project imprinted on me the importance of transparency and inclusivity in the pursuit of public good. I relished the opportunity to approach issues from peripheral perspectives and build things for wider populations to enjoy and learn from. \n\nI look forward to the app's widening presence across the park service and for the role similar technologies will play in the struggle to preserve environmental legacies for our future.",
      "bg": "#DCD9C7"
    }
  ],
  "tasks": [
    "UI Design",
    "UX",
    "Prototyping",
    "Animations",
    "Info Architecture",
    "Content Strategy"
  ],
  "next": "<a href=\"/project/dancemaker\">Dancemaker ⤑</a>",
  "cover": "https://res.cloudinary.com/henryholmesdesign/image/upload/f_auto,q_auto/v1568066608/Park%20Mobile/NPS_Selfie-min.jpg",
  "subtitle": "Building a platform for National Parks",
  "title": "Park Mobile",
  "type": "Case Study",
  "end": "July 2019",
  "id": "0",
  "tools": [
    "Sketch",
    "Origami",
    "Airtable",
    "Invision",
    "XCode"
  ],
  "ongoing": false,
  "roles": [
    "Product Designer"
  ]
}