{
  "start": "January 2016",
  "sections": [
    {
      "heading": "## Parvum rector Iliacas moenibus",
      "body": "Lorem markdownum, aetas illis grandior supplevit aquas curva libido. Praevius est plenaque mansura tenui falle mirum velamine parem, in reperto Anaxareten in amor. Supplex mihi portant posita tempora relictis disces stipes retrahebat hunc; vix tempus.\n\nAurea protinus Iovis insigne inde sibi arbutus. Quo tibi meritis, nec unco exanimem, in sed illud. Troes seu appellantque scelus pedibusque nihil deorum, florem bracchia utque umbrosum retroque cessit. Toto caedis rursus, redimebat virtutis herbas et terribiles rubore.\n\n![](https://loremflickr.com/640/360)\n\n### Tirynthius Scyllae mixtae\n\nAnienis nutu Iovis, densum refert labore: est est aequora plangere turbaque cognatas Niobe. More percussa at terris quin et viribus plura plura sunt contrarius dextra crudeles enixa sequitur vocesque actorum, repetemus quantus. Auster spatiosi tu iam, orbem factas. Sub dabas usae mihi deducit in quoque aratos tributum redolent, in est. Aras perstat rebus per.\n\n![](https://loremflickr.com/640/360)\n\n## Atria vertex\n\nPenetralia debere illic tamen audito loca flammis! Silvas quem magnum enim precor et vinci ipse honorque, volui; et ferunt natas aures prius.\n\n## Substiterat et dispar Priamum corpus in verba\n\nEt deum glaebam incurrere rettulit oppressos munera: in illam pectora, messoris Haliumque satos quaque amplexas ut tamen. Loca iuvenci dixit malo, minus, omnia inpositus tamen naufragus. Undis posuere, respicere, nostra? Per Iovis iussum, voverat nam di moderantum at quisquam tenent obstitit at censu.\n\nCaeleste narrare dominoque invecta vestigia inprudens quoque est. Exorata nimiumque pelagi, dextra, protinus tendentem primos gaudetque mediis. Tantum deos viam robora, indicat voce cauda, superosque, retracto parte.\n\n![](https://loremflickr.com/840/360)\n\n## Non et hosti mihi inter est ille\n\nPhlegraeis ut sileam trepidantis quanto virgo, huc partes omnibus quantum, tabuerit. Sit certa, iter Propoetides bracchia nisi officium: hanc tenet aries. Est moverat duris fluminea, sed aurum feto deum numen me quoque superis alteriusque. Vasto circumfluit et neque fugientia placet Latina secum flammas auras proxima ignoscere violave!\n\n![](https://loremflickr.com/375/667)\n\nNec patitur mihi. Nullis in inferre nomine dentibus et instimulat grates tenentem teneri ante Bacchus. Donec ab fatali non cervina tacitas et saeva tenues, persequar quamvis. Tonsa declivis, et quos dum parvae captat. Utrumque este processisse aethera deus?"
    }
  ],
  "tasks": [
    "UX",
    "Prototyping",
    "Animations",
    "Info Architecture",
    "Content Strategy",
    "UI Design"
  ],
  "cover": "https://ucarecdn.com/f3aa191a-cf6c-4a40-b058-3174337b1251/-/preview/-/enhance/52/",
  "subtitle": "Building a mobile framework that goes places",
  "title": "Park Mobile",
  "type": "Case Study",
  "end": "Invalid date",
  "id": "0",
  "tools": [
    "Sketch",
    "Framer/Origami",
    "Airtable",
    "Python",
    "XCode"
  ],
  "ongoing": true,
  "roles": [
    "Product Designer"
  ]
}